# **Intro to Datascience**

#### *Database*

*It is a piece of software that stores and manages data*

*SQL - Structure Query language*

**Datascience Flow chart**

<img src="flowchart.png" alt="Flowchart" width="800px">

***List of common databases:***

- MySQL
- sqllite
- Oracle
- Postgres
- Neo4j

### **Data Manipulation Tools in python**

- Numpy
- Pandas

### **Data Visualization Tools in python**

- Matplotlib
- Seaborne

### **ML Algorithm package in python**

- Scipy 
- Scikit Learn

## *MySQL*

***Installing configuring MySQL database***
- *Download from this [link](https://dev.mysql.com/downloads/file/?id=514518)*
- *Install MySQL on your personal Computer by following this [Video](https://www.youtube.com/watch?v=IqYfmckxeyE)*
- *Configure Username as `root`*
- *Configure Password as `root@123`*

***Operations in MySQL***

*CRUD - Create Read Update Delete*

### Data Definition Language(DDL)

1. CREATE
2. ALTER
3. DROP
4. TRUNCATE

### Data Manipulation Language(DML)

1. SELECT
2. INSERT
3. UPDATE
4. DELETE

### SQL QUERY

```
USE     world       ;
 |         |        |
command  arguments semicolon
```

```
USE world;

-- show all the tables inside the database.
SHOW tables;

-- select command select the specific column, use * if we need select all column
SELECT * FROM city;
SELECT ID, Name, District FROM city;

-- filtering in mysql Where
SELECT * FROM city WHERE CountryCode="IND" AND Name="Delhi";
SELECT * FROM city WHERE population > 2000000;

SELECT * FROM countrylanguage;

SELECT * FROM countrylanguage WHERE IsOfficial = "T" AND CountryCode = "IND";

SELECT * FROM countrylanguage WHERE IsOfficial="T";

-- Functions in SQL
SELECT avg(population) FROM city;

SELECT * FROM city WHERE population > 350468;

SELECT count(ID) FROM city;

SELECT count(CountryCode) FROM city;

SELECT count(distinct CountryCode) FROM city;

SELECT ID, Name, District, length(Name) AS "Name_Length" FROM city;

SELECT concat(Name, District, population) AS "Concat_namedistrict", Name, District FROM city;

SELECT upper(District), District FROM city;

SELECT lower(District), District FROM city;
```

### Data Types in MySQL

1. Numeric
   1. Int = -214783648 to 214783647
   2. Bigint 
   3. Tinyint = -128 to 127
   4. Float = decimal
2. String
   1. Char = char(5) eg: kamal = 0 to 255
   2. varchar = varchar(size) _ 0 to 65535
   3. Text = length constrain is not applicable
3. DateTime
   1. Date - "2001-12-03" "yyyy-mm-dd" 
   2. Time - "10:23:54" "HH:MM:SS"
   3. Datetime - "2001-12-03 10:23:54" _ "yyyy-mm-dd HH:MM:SS"
   4. Timestamp - "2001-12-03 10:23:54 UTC"

```
# Create a dtabase in MySQL

CREATE DATABASE School;

USE school;

# Create a table in MySQL
CREATE TABLE class(Name char(30), Section char(1), Tutor_name char(30), Student_count int, Class_start_date date);

SHOW TABLES;

# Inserting values into table
INSERT INTO class(Name, Section, Tutor_name, Student_count, Class_start_date) values("Surya", "B", "Ajay", 57, "2002-10-20");

INSERT INTO class(Name, Section, Tutor_name, Class_start_date) values("Prakash", "B", "Ajay", "2002-10-20");

SELECT * FROM class;

# Altering the table
ALTER TABLE class ADD(Class_end_date date);
ALTER TABLE class MODIFY COLUMN Tutor_name Char(100);
ALTER TABLE class DROP COLUMN Class_end_date;
ALTER TABLE class RENAME COLUMN New_name TO Tutor_name;
```